<template>
    <!-- 父向子传值 -->
    <div class="pa-breadcrumb">
        <div class="container-fluid">
            <div class="pa-breadcrumb-box">
                <h1>商品详情</h1>  
                <ul>
                    <li><a href="#">主页</a></li>
                    <li>商品详情</li>
                </ul>
            </div>
        </div>
    </div>
    <div>
        <div class="pa-product-single spacer-top">
            <cpn :cproductmes="productmes"></cpn>
        </div>
    </div>
</template>
<script>
//父向子传值
import cpn from '../components/cproduct.vue'
export default {
    name: "",
    data() {
        return {
            productmes: [{
                pid: 1,
                price: 150,
                name: "绿茶",
                Categorie: "药用",
                imgsrc: require("../assets/images/product1.png"),
                introduce: "绿茶，山茶科山茶属灌木或小乔木植物，绿茶形态自然、色泽鲜绿，采取茶树的新叶或芽，经杀青、整形、烘干等工艺制作而成，保留了鲜叶的天然物质；茶叶尖而细，表面光滑；开白色花，花朵较小，呈多边形；花期10月-次年2月。绿茶因其干茶呈绿色、冲泡后的茶汤呈碧绿、叶底呈翠绿色而得名。绿茶原产于中国，在中国河南、贵州、浙江等地广泛分布，也分布于日本、泰国、朝鲜、韩国等国。绿茶喜湿润、温暖的环境，不耐阳光、高温、湿气，种植时以肥沃疏松的微酸性土壤为宜。绿茶的繁殖方法主要有播种繁殖和扦插繁殖，一般采用扦插繁殖。《雷公炮制药性解》中记载绿茶：“绿茶，性微寒，味苦、甘。”绿茶具有收敛、利尿、提神的功效，用于治疗神疲多眠、头痛目昏、烦渴、小便不利、酒毒等病症。绿茶是中国历史上出现最早的茶类，有着悠久的生产历史；唐代时期中国已流行用蒸青法制造绿茶，后传入日本，并被许多国家所采用；明代时期，发明了炒青茶制造绿茶。绿茶香高味长、品质优异，且造型独特，具有较高的艺术欣赏价值。绿茶是中国产量最高的茶类，也是品种最丰富、名茶最多的茶类，经济价值丰富"
            }, {
                pid: 2,
                price: 160,
                name: "红茶",
                Categorie: "收藏",
                imgsrc: require("../assets/images/product2.png"),
                introduce: "红茶，为山茶科植物茶的嫩叶或嫩芽。红茶并不是天然生长的，而是在明末清初，在绿茶的基础上制做成的。是以适宜的茶树新牙叶为原料，经萎凋、揉捻（切）、发酵、干燥等一系列工艺过程精制而成的茶， 发酵作用使茶叶中的成分产生化学反应，以水冲泡，不仅香气迎人，还呈现出特有的深红茶色，因此被人称为“红茶”。红茶产于中国、印度、斯里兰卡等国。红茶原来是东方人特有的茶饮，后来西传欧洲成为王公贵族们喜爱的茗品。 红茶主要有：祁红，产于安徽祁门、至德以及江西浮梁等地；滇红，产于云南佛海、顺宁等地；霍红，产于安徽六安、霍山等地；苏红，产于江苏宜兴；越红，产于浙江诸暨、浦江等地；湖红，产于湖南安化、新化、桃源等地；川红，产于四川宜宾、高县等地。红茶的特点是色泽乌润，味厚而带有焦苦，有麦芽香，茶汁红艳红茶含有维生素、咖啡因、氨基酸、矿物质、多糖、茶多酚等多种营养和功效成分。研究表明，红茶具有辅助降血糖、降血压、降血脂的功效。红茶中的茶色素具有抗氧化、抗肿瘤、抗炎抑菌、抗突变、抗病毒、除臭等功效。能清热解表；用于急、慢性肠炎，痢疾；急性肝炎，消化不良，衰老等病症。"
            },
            {
                pid: 3,
                price: 170,
                name: "黑茶",
                Categorie: "熏香",
                imgsrc: require("../assets/images/product3.png"),
                introduce: "黑茶，山茶科茶属乔木植物。其树枝较直立，分枝少，树高8米左右，幼嫩芽叶青绿色，无或极少绒毛。 黑茶芽壮叶厚，叶色黄绿间有红斑红茎叶，条形粗壮结实。  每年采摘时间在6月中下旬芒种前后。明嘉靖年间，湖南安化采用绿茶湿坯堆积渥堆，松材明火干燥法制作，使茶色泽变黑变褐，故名黑茶。黑茶属于后发酵茶，是中国特有的茶类，生产历史悠久，产于中国云南、湖南、湖北、广西等地。 茶树喜湿润气候多雨，多生于山林，可种植于酸性土壤中。  茶树的繁殖方式有种子繁殖、短穗托插繁殖，还能进行组织培养、嫁接、压条、分株等。 黑茶中含有丰富的维生素和矿物质，另外还有蛋白质、氨基酸和糖类物质等。常饮黑茶可以补充人体必须的矿物质和各种维生素，有利于贫血症的预防和食疗。另外黑茶还有降脂减肥、软化人体血管、预防心血管疾病等功效。  黑茶中的普洱茶历史悠久，是中国古老的茶之一。 “香陈九畹芳兰气，品尽千年普洱情”描述了年份久远的普洱茶散发的陈香，品起来就像是在品味着历史一般，也让茶的陈香在历史经久不散"

            },
            {
                pid: 4,
                price: 180,
                name: "白茶",
                Categorie: "珍藏",
                imgsrc: require("../assets/images/product4.png"),
                introduce: "白茶，属微发酵茶，是中国茶类中的特殊珍品。因成品茶多为芽头，满披白毫，如银似雪而得名。中国六大茶类之一。白茶不经杀青或揉捻，只经过晒或文火干燥后加工的茶，具有外形芽毫完整，满身披毫，毫香清鲜，汤色黄绿清澈，滋味清淡回甘的品质特点。白茶主要产区在福建福鼎、政和、柘荣、武汉新洲旧街、蕉城天山、松溪、建阳、云南景谷等地。基本工艺包括萎凋、烘焙（或阴干）、拣剔、复火等工序。云南白茶工艺主要晒青，晒青茶的优势在于口感保持茶叶原有的清香味。萎凋是形成白茶品质的关键工序。白茶因茶树品种和原料要求的不同，分为白毫银针、白牡丹、寿眉、贡眉   四种产品。"
            },]
        };
    },
    methods: {

    },
    components: {
        cpn
    }
}
</script>
<style scoped></style>